In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "City": ["NY", "LA", "Chicago", "Houston"]
}
df = pd.DataFrame(data)

print(df['Name'])     # Single column
print(df[['Name', 'Age']])  # Multiple columns
print(df[['Name', 'Age', 'City']]) # All columns

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago
3    David   40  Houston

In [3]:
print(df.loc[0])          # First row (label = 0)
print(df.loc[1:2])        # Rows with labels 1 to 2 (inclusive)
print(df.loc[0, "Name"])  # Single cell: row 0, column 'Name'
print(df.loc[1:3, ["Name", "City"]])  # Rows 1 to 3, columns 'Name' and 'City'

Name    Alice
Age        25
City       NY
Name: 0, dtype: object
      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago
Alice
      Name     City
1      Bob       LA
2  Charlie  Chicago
3    David  Houston

In [4]:
print(df.iloc[0])          # First row
print(df.iloc[0:2])        # First two rows
print(df.iloc[0, 1])       # Single cell: row 0, column index 1

Name    Alice
Age        25
City       NY
Name: 0, dtype: object
    Name  Age City
0  Alice   25   NY
1    Bob   30   LA
25

# Boolean Indexing & Filtering

In [6]:
print(df[df['Age'] > 30])

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston

In [8]:
print(df[df['Age'] > 23])

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago
3    David   40  Houston

In [9]:
df[df['City'] == 'NY']

    Name  Age City
0  Alice   25   NY

In [11]:
df[(df['Age'] > 23) & (df['City'] == 'NY')]

    Name  Age City
0  Alice   25   NY

In [12]:
df[df['Age'].between(30, 40)]

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago
3    David   40  Houston

In [13]:
df[df['Age'].between(25, 35)]

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

In [14]:
df[df['City'].isin(['NY', 'LA'])]

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA

In [17]:
print(df.query("Age > 30 and City == 'Chicago'"))

      Name  Age     City
2  Charlie   35  Chicago